# SetFieldOrder Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..SetFieldOrder Method
ScheduleDefinition Class See Also
---
Reorders the fields in the schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetFieldOrder(
	IList<ScheduleFieldId> fieldIds
)
```

Visual Basic
---
```text
Public Sub SetFieldOrder ( _
	fieldIds As IList(Of ScheduleFieldId) _
)
```

Visual C++
---
```text
public:
void SetFieldOrder(
	IList<ScheduleFieldId^>^ fieldIds
)
```

# ### Parameters
fieldIds
    Type: System.Collections.Generic..::..IList<(Of <(<'ScheduleFieldId>)>)> The field IDs in a new order.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | fieldIds does not contain exactly the same field IDs as this ScheduleDefinition currently contains. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace